---
kind: method
id: M:Autodesk.Revit.DB.View.GetDepthCueing
zh: 视图
source: html/e60cb801-5a19-1fd7-6a44-0751cf87f162.htm
---
# Autodesk.Revit.DB.View.GetDepthCueing Method

**中文**: 视图

Returns the current depth cueing settings for the view.

## Syntax (C#)
```csharp
public ViewDisplayDepthCueing GetDepthCueing()
```

## Returns
Current depth cueing settings.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - This view cannot use Depth Cueing